
/**********************************************************************************//**
	@file           test.cpp
	@brief          スタックのテストを行います
*//***********************************************************************************/

#include "pch.h"
#include"..\メインプロジェクト\Stack.h"

//================================= 要素数の取得 =====================================

/**********************************************************************************//**
	@brief		リストが空である場合の要素数の取得テスト
	@details	ID:リスト-0\n
				要素数の取得機能のテストです。\n
				リストが空である場合の戻り値を確認しています。\n
				要素数が0であれば成功です。\n
*//***********************************************************************************/
TEST(TestGetSize, WhenEmpty) {
	Stack<int> stack;
	EXPECT_EQ(0, list.GetSize());
}